go-go-golems/esp32-s3-m5/0099-esp32-p4-picocalc-display-keyboard/sdkconfig.defaults
# ESP32-P4-WIFI6 PicoCalc display + keyboard smoke test
CONFIG_IDF_TARGET="esp32p4"

# Console: CH343 USB-UART bridge on ESP32-P4 UART0 (GPIO37 TX, GPIO38 RX).
# CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG is not set
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Keep layout small and below 16 MB while ESP-IDF warns about >16 MB flash access.
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y

# PSRAM — 32 MB stacked PSRAM on ESP32-P4NRW32, verified in earlier bring-up.
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y
